WindowsApplication1/WindowsApplication1/bin/Debug/Log/Request/getSellQuote.xml

<soap:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header />
  <soap:Body>
    <getSellQuote xmlns="http://api.ws.ba.com">
      <msgName>getSellQuote</msgName>
      <ClientID>23423</ClientID>
      <branchID>234</branchID>
      <tranType>
      </tranType>
      <userID>23423</userID>
      <currCode>342</currCode>
      <spreadType>34</spreadType>
      <foreignAmount>2342</foreignAmount>
      <localAmount>3432</localAmount>
      <denominationMix>23423</denominationMix>
      <requestSecToken>KbptBXZuykAPj9lFyMaK/nB/kkZdVG7smd01zgwFgT6BUN63XzxsLj2ZjyegSRm4eV0FTJwG9nRuFXXbaMbsKruqrR1n7xAUXC3camNWagY+En7vOMQxsuMIkk022JMne7oxHwLuFSPJB0YtsYLk+1R1kABs8U9ulp42y8QQdxKxxgBgZXrC4cBAtZ/ffGn4qcp3KtiH6WMGFCoVevHd2JvFgdLJtK5eA6RwPzmspFa4p+WR37PAI8Xzq9pDNI60gVVHI8A3iJd7Fd6NNCaq+E5iVh4l0tr3WHmwjKq6fDc=</requestSecToken>
    </getSellQuote>
  </soap:Body>
</soap:Envelope>